app/views/memberships/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."admin" = ?  [["admin", 0]]
---
    <%= form.label "Student:" %></br>
    <%= form.select :user_id, User.where(:admin => false).collect {|p| ["#{p.Fname} #{p.Lname}: (#{p.email})", p.id ] } %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <div class="field">
    <%= form.hidden_field :group_id, :value => Group.find(params[:group_id]).id, :readonly => true %>