app/views/memberships/index.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
<%# shoes all students in a group, allows admin to removes students from groups %>
<h1>Students in <%= Group.find(params[:group_id]).gname %></h1>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <tr>
          <td><%= User.find(m.user_id).email %></td>