app/views/memberships/new.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%# renders _form to add a student to a group %>
<h1>Add Student to <%= Group.find(params[:group_id]).gname.capitalize %></h1>