project6_peer_eval_tool/app/views/groups/_form.html.erb

    <%= form.hidden_field :user_id, :value => current_user.id  %>
    <%= form.hidden_field :course_id, :value => Course.find(params[:course_id]).id  %>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]