app/views/groups/index.html.erb

      <% if user_signed_in? and !current_user.try(:admin?) %>
      	<% for i in 0...group.membership_ids.length %>
---
SELECT "memberships"."id" FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 1]]

	               <td><%= group.membership_ids.length %></td>
                 <td><%= Course.find(group.course_id).cname %></td>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <td><%= link_to group.gname, group, id: "link" %></td>
          <td><%= group.membership_ids.length %></td>
          <td><%= Course.find(group.course_id).cname %></td>
---
SELECT "memberships"."id" FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

              <% evalsFinished = true %>
                  <% for i in 0...group.evaluate_ids.length %>
                      <% if Evaluate.find(group.evaluate_ids[i]).attempt == false %>
---
SELECT "evaluates"."id" FROM "evaluates" WHERE "evaluates"."group_id" = ?  [["group_id", 1]]

                  <% for i in 0...group.evaluate_ids.length %>
                    <% if Evaluate.find(group.evaluate_ids[i]).attempt == true %>
---
SELECT  "evaluates".* FROM "evaluates" WHERE "evaluates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]