app/views/groups/show.html.erb

SELECT "memberships"."id" FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 1]]
---
<h1><%= @group.gname.capitalize %></h1>
<% if @group.membership_ids.length == 0 %>

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	<tr><td>
	<%= User.find(Membership.find(@group.membership_ids[i]).user_id).Fname %> <%= User.find(Membership.find(@group.membership_ids[i]).user_id).Lname %>

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	<td>
	<%= User.find(Membership.find(@group.membership_ids[i]).user_id).email %>

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	<td>
	<%= User.find(Membership.find(@group.membership_ids[i]).user_id).score %>