project6_peer_eval_tool/app/views/courses/index.html.erb

		<td><%= link_to course.cname, course %></td>
              	<td><%= course.group_ids.length %></td>
---
SELECT "groups"."id" FROM "groups" WHERE "groups"."course_id" = ?  [["course_id", 3]]