app/views/ratings/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        <% if (r.group_id == Group.find(params[:group_id]).id) %>
          <td><%= User.find(r.user_id).Fname %><% User.find(r.user_id).Lname %></td>