app/views/welcomes/_form.html.erb


  <% @users = User.all.collect %>
  <% @members = [] %>
  <% for i in 0...Group.find(params[:group_id]).membership_ids.length %>
    <% @users.each do |user| %>
      <% if user.membership_ids.include? Group.find(params[:group_id]).membership_ids[i] %>
---
SELECT "users".* FROM "users"
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "memberships"."id" FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 3]]