app/views/evaluates/index.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        <tr>
          <td><%= Group.find(e.group_id).gname %></td>
          <td><%= User.find(e.ratee_id).Fname %> <%= User.find(e.ratee_id).Lname %></td>