app/views/courses/show.html.erb

SELECT "groups"."id" FROM "groups" WHERE "groups"."course_id" = ?  [["course_id", 1]]
---
<h2>Courses:</h2>
<% if @course.group_ids.length == 0 %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	<h2>
		<%= link_to Group.find(@course.group_ids[i]).gname, memberships_path(:group_id => @course.group_ids[i]), id: "link"  %>