app/controllers/groups_controller.rb

  def index
    # URL redirection to home page if user is not signed in
    if !user_signed_in?
      redirect_to welcomes_path
    end
    if user_signed_in? and current_user.try(:admin?)
      @groups = Group.where(user_id: current_user)
    else
      @groups = Group.all
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = ?  [["user_id", 1]]
SELECT "groups".* FROM "groups"

  def create
    @group = current_user.groups.build(group_params)
    # Create and save a group
      if @group.save
---
INSERT INTO "groups" ("gname", "course_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["gname", "Test Group"], ["course_id", 2], ["user_id", 2], ["created_at", "2021-12-06 16:02:10.633462"], ["updated_at", "2021-12-06 16:02:10.633462"]]

    def set_group
      @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]