project6_peer_eval_tool/app/controllers/courses_controller.rb

  def index
     # URL redirection to home page if user is not signed in
    if !user_signed_in?
      redirect_to welcomes_path
    end
    # URL redirection to homepage if user signed in is not admin
    if user_signed_in? and !current_user.try(:admin?)
      redirect_to welcomes_path
    end
    # show all courses
    @courses = Course.where(user_id: current_user)
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = ?  [["user_id", 1]]

  def show
    # URL redirection to home page if user is not signed in
    if !user_signed_in?
      redirect_to welcomes_path
    end

    # URL redirection to homepage if user signed in is not admin
    if user_signed_in? and !current_user.try(:admin?)
      redirect_to welcomes_path
    end
    # show all groups for a course
    @groups = Group.where(course_id: @course.id).all||nil
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @course = current_user.courses.build(course_params)
    @course.semester = params[:semester]

    # Creates a new course and saves it
      if @course.save
---
INSERT INTO "courses" ("cname", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cname", "CSE 3901"], ["user_id", 2], ["created_at", "2021-12-06 16:02:02.254196"], ["updated_at", "2021-12-06 16:02:02.254196"]]

    def set_course
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]