project6_peer_eval_tool/app/controllers/evaluates_controller.rb

SELECT "evaluates".* FROM "evaluates"
---
  def index
    if !user_signed_in?
      redirect_to welcomes_path
    end
    @evaluates = Evaluate.all