project6_peer_eval_tool/app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships"
---
  def index
    if !user_signed_in?
      redirect_to welcomes_path
    end
    if user_signed_in? and !current_user.try(:admin?)
      redirect_to welcomes_path
    end

    @memberships = Membership.all

INSERT INTO "memberships" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["group_id", 3], ["created_at", "2021-12-07 01:45:45.822781"], ["updated_at", "2021-12-07 01:45:45.822781"]]
---
  def create
    # Create a new member
    @membership = Membership.new(membership_params)

      if @membership.save