project6_peer_eval_tool/app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"
---
  def index
    if !user_signed_in?
      redirect_to welcomes_path
    end
    @ratings = Rating.all

INSERT INTO "ratings" ("evaluate_id", "user_id", "group_id", "score", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["evaluate_id", 1], ["user_id", 4], ["group_id", 3], ["score", 10.0], ["comments", "Good Team mate"], ["created_at", "2021-12-07 02:10:43.449227"], ["updated_at", "2021-12-07 02:10:43.449227"]]
SELECT  "evaluates".* FROM "evaluates" WHERE "evaluates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 10.0], ["updated_at", "2021-12-07 02:10:43.482584"], ["id", 4]]
UPDATE "users" SET "commented_num" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["commented_num", 1], ["updated_at", "2021-12-07 02:10:43.506015"], ["id", 4]]
---
  def create
    @rating = Rating.new(rating_params)

      if @rating.save
        flash[:success] = "Rating was successfully created"
        redirect_to ratings_path

	current_score=User.find(Evaluate.find(@rating.evaluate_id).ratee_id).score
	new_num=User.find(Evaluate.find(@rating.evaluate_id).ratee_id).commented_num + 1
	new_score=(current_score+@rating.score)/new_num
	User.find(Evaluate.find(@rating.evaluate_id).ratee_id).update_attribute :score, new_score
	User.find(Evaluate.find(@rating.evaluate_id).ratee_id).update_attribute :commented_num, new_num